home/config/doom/config.org
#+PROPERTY: header-args elisp :tangle ./config.el

* Introduction

This is my Emacs configuration. I'm using [[https://github.com/doomemacs/doomemacs][Doom Emacs]], which is preconfigured
with a ton of plugins, and as such a great starting point for a modern Emacs configuration, while still being very modular. This file contains settings,
snippets and other customizations that I've added on top of Doom.

This file is not written in Emacs Lisp, but in [[https://orgmode.org/][Org
Mode]]. I'm using [[https://en.wikipedia.org/wiki/Literate_programming][Literate
Programming]] for my configuration, which means that  the configuration file
contains both documentation (in Org Mode) and code (in Emacs Lisp) intermixed
together in a single file. The documentation can be exported to various formats
such as HTML or PDF, while the code can be executed by Emacs to customize the
editor. So this is a living document, that can be used as a reference for
certain decisions I've made or workarounds I've implemented. 

* Base Settings
First, I set up some basic settings, such as my name and email address.
#+begin_src elisp
(setq user-full-name "Tibor Pilz"
      user-mail-address "tibor@pilz.berlin")
#+end_src

Although I would like to keep the differences between my development
environments as low as possible - also to counteract configuration drift, there
are some settings that need to be specific to some of my machines - e.g. the
font-size. So, I define some basic functions to check which machine is curently
running this config, and adjust certain settings accordingly.

#+begin_src elisp
(defun is-mac ()
  (string-equal system-type "darwin"))

(defun is-linux ()
  (string-equal system-type "gnu/linux"))

(defun is-workstation ()
  (string-equal (system-name) "workyMcWorkstation"))
#+end_src

** Font selection
Instead of setting the fonts twice, I'll define a scaling factor depending on
the macine I'm running on, and then use that to set the font size.

#+begin_src elisp
(setq font-scale-factor (if (is-workstation) 1.3 1.0))
#+end_src

Since I'm using Evil/ (vim-keybindings), I prefer relative line numbers.

#+begin_src elisp
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size (scale-font 14)))

;; (setq doom-font (font-spec :family "FiraCode Nerd Font" :size (scale-font 14))
;;       doom-variable-pitch-font (font-spec :family "sans" :size (scale-font 12))
;;       doom-big-font (font-spec :family  "sans" :size (scale-font 16))
;;       doom-serif-font (font-spec :family "FreeSerif" :weight 'light :size (scale-font 14)))
#+end_src

Adjust org-mode headlines.
#+begin_src elisp

(let* ((variable-tuple '(:font "ETBembo"))
       (headline `(:inherit default :weight bold)))
  (custom-theme-set-faces
   'user
   `(org-level-8 ((t (,@headline ,@variable-tuple))))
   `(org-level-7 ((t (,@headline ,@variable-tuple))))
   `(org-level-6 ((t (,@headline ,@variable-tuple))))
   `(org-level-5 ((t (,@headline ,@variable-tuple))))
   `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
   `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.17))))
   `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.23))))
   `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.3))))
   `(org-document-title ((t (,@headline ,@variable-tuple :height 1.4 :underline nil))))))
#+end_src

** Line numbers
Since I'm using Evil/vim-keybindings, I prefer relative line numbers as default.

#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src


#+begin_src elisp
(setq tab-width 2)
#+end_src

* Org Mode

I use org-mode to manage my tasks, take notes, and create outlines within Emacs.
It helps increase my productivity by having all my notes and tasks in one easily
accessible place.

In a general sense, org files are similar to markdown files, meaning they can
be read as plain text, but they also contain some additional metadata that can
be used for organization and formatting purposes. However, thanks to extensive
tooling (most of it in Emacs), org files are more powerful and versatile than
Markdown files, as they offer features such as outlining, table editing, and
interactive code blocks (like Jupyter). In fact, org mode is what makes this
literate config possible.

** Base Settings
First, some basic settings for org-mode, such as the directory where I keep my
org files, and the files that I want to include in my agenda.
I'll also enable property inheritance, which means that properties set for an
entire file or parent heading will be inherited by all child headings.

#+begin_src elisp
(setq org-directory "~/org/")
(setq org-agenda-files (list org-directory))

(setq org-use-property-inheritance t)
(setq org-log-done 'time) ; Log time when task completes
(setq org-list-allow-alphabetical t)       ; a, A, a) A) list bullets)
(setq org-catch-invisible-edits 'smart) ; don't treat lone _ / ^ as sub/superscripts, require _{} / ^{})


(setq org-return-follows-link 1)
(setq calendar-week-start-day 1) ;; start on monday
(setq org-agenda-include-diary t)
#+end_src

** Visual improvements
Now, some visual improvements.

Enabling =mixed-pitch-mode= will make the text in org-mode look more like a
book, with the headings in a larger font, and the body text in a smaller font.
This is a great way to make your more readable, and it also helps with focus on
the content, instead of the formatting.
In addition, I'm changing the way headlines look, with top-level headlines
actually having a larger font - I'm also removing the color from the headlines,
since in this mode, the distinction between the different levels is already made by the font size.

#+begin_src elisp
(defun org-mode-mixed-pitch-hook ()
  (if mixed-pitch-mode
      (let* ((variable-tuple '(:font "sans"))
             (headline `(:inherit default)))
        (custom-theme-set-faces
         'user
         `(org-level-8 ((t (,@headline ,@variable-tuple))))
         `(org-level-7 ((t (,@headline ,@variable-tuple))))
         `(org-level-6 ((t (,@headline ,@variable-tuple))))
         `(org-level-5 ((t (,@headline ,@variable-tuple))))
         `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1 :weight bold))))
         `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.2 :weight bold))))
         `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.4 :weight bold))))
         `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.6 :weight bold))))
         `(org-document-title ((t (,@headline ,@variable-tuple :height 1.8))))))
    (let* ((variable-tuple '(:font "FiraCode Nerd Font" :height 1.0 :weight normal))
           (headline `(:inherit default)))
      (custom-theme-set-faces
       'user
       `(org-level-8 ((t (,@headline ,@variable-tuple))))
       `(org-level-7 ((t (,@headline ,@variable-tuple))))
       `(org-level-6 ((t (,@headline ,@variable-tuple))))
       `(org-level-5 ((t (,@headline ,@variable-tuple))))
       `(org-level-4 ((t (,@headline ,@variable-tuple))))
       `(org-level-3 ((t (,@headline ,@variable-tuple))))
       `(org-level-2 ((t (,@headline ,@variable-tuple))))
       `(org-level-1 ((t (,@headline ,@variable-tuple))))
       `(org-document-title ((t (,@headline ,@variable-tuple))))))))

(add-hook 'mixed-pitch-mode-hook #'org-mode-mixed-pitch-hook)
#+end_src

#+RESULTS:
| +latex-fold-set-variable-pitch-h | solaire-mode-reset-buffer | org-mode-mixed-pitch-hook |

To reset the faces to their original values, I'm using a hook that is run when ~mixed-pitch-mode~ is disabled.

#+begin_src elisp
(defun reset-org-faces ()
  (custom-theme-set-faces
   'user
   `(org-level-8 ((t (inherit))))
   `(org-level-7 ((t (inherit))))
   `(org-level-6 ((t (inherit))))
   `(org-level-5 ((t (inherit))))
   `(org-level-4 ((t (inherit))))
   `(org-level-3 ((t (inherit))))
   `(org-level-2 ((t (inherit))))
   `(org-level-1 ((t (inherit))))
   `(org-document-title ((t (inherit))))))

(add-hook 'disable-mixed-pitch-mode-hook #'reset-org-faces)
#+end_src

*** TODO Padding
:PROPERTIES:
:header-args: :tangle no
:END:

Set up custom padding for org-mode headings and blocks. Currently disabled since
it should only be used with =mixed-pitch-mode=.

#+begin_src elisp :tangle packages.el
(package! org-padding :recipe (:host github :repo "toncherami/org-padding"))
#+end_src

#+begin_src elisp
(use-package! org-padding
  :config
  (setq org-padding-heading-padding-alist
        '((0.0 . 1.0) (0.0 . 0.8) (0.0 . 0.6) (0.0 . 0.5) (0.0 . 0.5) (0.0 . 0.5) (0.0 . 0.5) (0.0 . 0.5))))
#+end_src

*** Org-Modern
[[https://github.com/minad/org-modern][Org-modern]] contains a lot of nice visual improvements for org-mode.

#+begin_src elisp :tangle packages.el
(package! org-modern)
#+end_src


Use it globally and tweak it some more.
#+begin_src elisp
(modify-all-frames-parameters
 '((right-divider-width . 8)
   (internal-border-width . 8)))
(dolist (face '(window-divider
                window-divider-first-pixel
                window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))
(set-face-background 'fringe (face-attribute 'default :background))

(use-package! org-modern
  :after org
  :custom
  (org-modern-star '("◉" "○" "◈" "◇" "•"))
  (org-modern-timestamp '(" %d.%m.%Y " . " %H:%M ")))

(setq
 ;; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
 org-ellipsis "…"

 ;; Agenda styling
 org-agenda-tags-column 0
 org-agenda-block-separator ?─
 org-agenda-time-grid
 '((daily today require-timed)
   (800 1000 1200 1400 1600 1800 2000)
   " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
 org-agenda-current-time-string
 "⭠ now ─────────────────────────────────────────────────")

(global-org-modern-mode)
#+end_src

*** Vastly improve the tree's display
#+begin_src elisp
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
#+end_src

*** Show passed deadlines as error
#+begin_src elisp
(setq org-agenda-deadline-faces
      '((1.001 . error)
        (1.0 . org-warning)
        (0.5 . org-upcoming-deadline)
        (0.0 . org-upcoming-distant-deadline)))
#+end_src

*** Show quote blocks in italic
#+begin_src elisp
(setq org-fontify-quote-and-verse-blocks t)
#+end_src
*** Defer font-lock
For a more responsive editing experience
#+begin_src elisp
(defun locally-defer-font-lock ()
  "Set jit-lock defer and stealth, when buffer is over a certain size."
  (when (> (buffer-size) 50000)
    (setq-local jit-lock-defer-time 0.05
                jit-lock-stealth-time 1)))
#+end_src

** Babel
*** HTTP requests via babel
#+begin_src elisp :tangle packages.el
(package! ob-http)
#+end_src

#+begin_src elisp
(use-package! ob-http
  :commands org-babel-execute:http)
#+end_src

*** Babel header args
See https://org-babel.readthedocs.io/en/latest/header-args/

#+begin_src elisp
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noeweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link")))
#+end_src

*** Auto-Tangling
I want org to tangle my config.org on file save, regardless whether it's the one
loaded or in a different repo.

#+begin_src elisp
(defun org-babel-tangle-config ()
  (when (string-equal (file-name-nondirectory (buffer-file-name))
                      "config.org")
    (let ((org-config-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'after-save-hook #'org-babel-tangle-config)))
#+end_src

** Import/Export
*** View exported file
#+begin_src elisp
(map! :map org-mode-map
      :localleader
      :desc "View exported file" "v" #'org-view-output-file)

(defun org-view-output-file (&optional org-file-path)
  "Visit buffer open on the first output file (if any) found, using `org-view-output-file-extensions'"
  (interactive)
  (let* ((org-file-path (or org-file-path (buffer-file-name) ""))
         (dir (file-name-directory org-file-path))
         (basename (file-name-base org-file-path))
         (output-file nil))
    (dolist (ext org-view-output-file-extensions)
      (unless output-file
        (when (file-exists-p
               (concat dir basename "." ext))
          (setq output-file (concat dir basename "." ext)))))
    (if output-file
        (if (member (file-name-extension output-file) org-view-external-file-extensions)
            (browse-url-xdg-open output-file)
          (pop-to-buffer (or (find-buffer-visiting output-file)
                             (find-file-noselect output-file))))
      (message "No exported file found"))))

(defvar org-view-output-file-extensions '("pdf" "md" "rst" "txt" "tex" "html")
  "Search for output files with these extensions, in order, viewing the first that matches")
(defvar org-view-external-file-extensions '("html")
  "File formats that should be opened externally.")

#+end_src

*** use github markdown
#+begin_src elisp
;; (use-package! ox-gfm :after ox :defer t)
#+end_src

*** Export headings up to five levels deep
#+begin_src elisp
(setq org-export-headline-levels 5)
#+end_src

*** automatic latex rendering
#+begin_code elisp :tangle packages.el
;; (package! org-fragtog)
#+end_code

#+begin_src elisp :tangle none
;; (use-package! org-fragtog
;;   :hook (org-mode . 'org-fragtog-mode))
#+end_src

*** Latex fragments
#+begin_src elisp
(setq org-highlight-latex-and-related '(native script entities))
#+end_src

*** Presentation
**** Export to Reveal.js
**** org-present
#+begin_src elisp :tangle packages.el
;; (package! org-present)
#+end_src

** Extensions
*** Roam
[[https://www.orgroam.com/][Org-Roam]] is an Emacs package that helps manage a
collection of plain text notes that are linked together to form a knowledge
graph. It provides features such as bidirectional linking, backlinks, graph
visualization, and search. It is heavily inspired by
[[https://roamresearch.com/][Roam Research]] and
[[https://obsidian.md/][Obsidian]].

I'm using a subdirectory of my org directory for org-roam files.
#+begin_src emacs-lisp
(setq org-roam-directory "~/org/roam")
#+end_src

**** Org-Roam UI
Although org-roam has a built-in graph visualization, compared to the
alternatives like Obsidian, it is severely lacking. Org-Roam UI is a web-based
interface for org-roam that approximates the graph visualization of Obsidian.

#+begin_src elisp :tangle packages.el
(package! org-roam-ui)
(package! websocket) ; dependency of `org-roam-ui'
#+end_src

#+begin_src elisp
(use-package! websocket
  :after org-roam
  :defer t)

(use-package! org-roam-ui
  :after org-roam
  :commands org-roam-ui-open
  :hook (org-roam . 'org-roam-ui-mode)
  :config
  (require 'org-roam) ; in case autoloaded
  (defun org-roam-ui-open ()
    "Ensure the server is active, then open the roam graph."
    (interactive    )
    (unless org-roam-ui-mode (org-roam-ui-mode 1))
    (browse-url-xdg-open (format "http://localhost:%d" org-roam-ui-port))))

(setq org-roam-ui-open-on-start t)
#+end_src

I'm using ~SPC-n-r-u~ to open org-roam-ui.

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("n" . "notes")
                   (:prefix-map ("r" . "roam")
                    :desc "Org-Roam UI" "u" #'org-roam-ui-open)))
#+end_src

**** Fixes
