home/config/doom/packages.el
(package! org-padding :recipe (:host github :repo "toncherami/org-padding"))

(package! org-modern)

(package! ob-http)

;; (package! org-present)

(package! org-roam-ui)
(package! websocket) ; dependency of `org-roam-ui'
