home/config/doom/config.org
***** "global-git-commit-mode" Error
For some reason, inserting a roam node causes the following error:
~global-git-commit-mode: Symbol’s function definition is void:
global-git-commit-mode~. According [[https://github.com/doomemacs/doomemacs/issues/6425#issuecomment-1433245212][this Github issue]], pinning ~transient~ and ~with-editor~ can fix
this.

#+begin_src emacs-lisp :tangle packages.el
(package! transient
  :pin "c2bdf7e12c530eb85476d3aef317eb2941ab9440"
  :recipe (:host github :repo "magit/transient"))

(package! with-editor
  :pin "bbc60f68ac190f02da8a100b6fb67cf1c27c53ab"
  :recipe (:host github :repo "magit/with-editor"))
#+end_src

*** TODO Google Calendar integration
:PROPERTIES:
:header-args: :tangle no
:END:

Via org-cal, I can sync my Google Calendar with my org agenda. Currently, it's
disabled because I need to solve secrets management first.

#+begin_src emacs-lisp :tangle packages.el
(package! org-gcal)
#+end_src

#+begin_src emacs-lisp
(use-package! org-gcal
  :config
  (setq org-gcal-client-id "CLIENT_ID"
        org-gcal-client-secret "CLIENT_SECRET"
        org-gcal-fetch-file-alit '(("tbrpilz@googlemail.com" . "~/org/schedule.org"))))
#+end_src

** Fixes and miscellanious improvements
*** Add shortcut for inserting  source, quote and example blocks

For some reqson, ~<S <TAB>~ has stopped working, but I stumbled across
~org-insert-structure-template~ which has the added benefit of choice.

Right now it's stuck on a simple emacs-y keybinding, so I'm changing it to a
more Evil-like one.

It seems that ~localleader~ is pretty swamped, especially in org-mode, so I guess
I waill try to cluster a few keybindings I want to add for aome time now - since
it's Babel related, ~<SPC> [localleader] B~ should fit as an entrypoint.

I'm adjusting the bindings just for ~org-mode~.

#+begin_src elisp
(map! :map org-mode-map
      :localleader
      (:prefix-map ("B" . "babel")
                   (:desc "Insert structure template" "c" #'org-insert-structure-template)))
#+end_src


*** Visual-line-mode messes with with plaintext (markdow, latex)
#+begin_src elisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
#+end_src

*** Prevent org-block face for latex fragments, since they look weird
#+begin_src elisp
(require 'org-src)
(add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t)))
#+end_src

*** Function to create an org buffer
#+begin_src elisp
(evil-define-command evil-buffer-org-new (count file)
  "creates a new ORG buffer replacing the current window, optionally
   editing a certain FILE"
  :repeat nil
  (interactive "P<f>")
  (if file
      (evil-edit file)
    (let ((buffer (generate-new-buffer "*new org*")))
      (set-window-buffer nil buffer)
      (with-current-buffer buffer
        (org-mode)))))
(map! :leader
      (:prefix "b"
       :desc "new empty ORG buffer" "o" #'evil-buffer-org-new))
#+end_src

*** Insert cdlatex enviornments and edit immediately
#+begin_src elisp
(add-hook 'org-mode-hook 'turn-on-org-cdlatex)

(defadvice! org-edit-latex-env-after-insert ()
  :after #'org-cdlatex-environment-indent
  (org-edit-latex-environment))
#+end_src

*** Disable auto-fill-mode
Auto-fill-mode automatically adds line breaks while typing in markdown and org files.
Since those files are going to be exported to pdf or html, which take care of proper formatting, I'm disabling this.

For Markdown, add a hook setting auto-fill-mode to -1.
#+begin_src elisp
(add-hook! markdown-mode (auto-fill-mode -1))
#+end_src

*** Nix-Doom-Emacs messes with dashboard
I'm using the nix-doom-emacs package to install emacs & dependencies, and for
some reason, using that binary, the Dashboard is disabled. [[https://github.com/nix-community/nix-doom-emacs/issues/88#issuecomment-1115500602][This comment]] in a
corresponding GH issue has a fix.

#+begin_src elisp
(add-hook! 'emacs-startup-hook #'doom-init-ui-h)
#+end_src
*** Faster insertion of org structures (i.e. source blocks)
For some reason, ~org-tempo~ does not start at launch, so I'm  loading it here.
#+begin_src elisp
(use-package! org-tempo)
#+end_src
** Capture
*** Improve org-capture dialog
#+BEGIN_SRC elisp
(after! org-capture
  (defun org-capture-select-template-prettier (&optional keys)
    "Select a capture template, in a prettier way than default
    Lisp programs can force the template by setting KEYS to a string."
    (let ((org-capture-templates
           (or (org-contextualize-keys
                (org-capture-upgrade-templates org-capture-templates)
                org-capture-templates-contexts)
               '(("t" "Task" entry (file+headline "" "Tasks")
                  "* TODO %?\n  %u\n  %a")))))
      (if keys
          (or (assoc keys org-capture-templates)
              (error "No capture template referred to by \"%s\" keys" keys))
        (org-mks org-capture-templates
                 "Select a capture template\n━━━━━━━━━━━━━━━━━━━━━━━━━"
                 "Template key: "
                 `(("q" ,(concat (all-the-icons-octicon "stop" :face 'all-the-icons-red :v-adjust 0.01) "\tAbort")))))))
  (advice-add 'org-capture-select-template :override #'org-capture-select-template-prettier))
#+END_SRC

The org-capture bin is rather nice, but It would be even nicer with a smaller frame, and
no modeline.
#+BEGIN_SRC elisp
(setf (alist-get 'height +org-capture-frame-parameters) 15)
;; (alist-get 'name +org-capture-frame-parameters) "❖ Capture") ;; ATM hardcoded in other places, so changing breaks stuff
(setq +org-capture-fn
      (lambda ()
        (interactive)
        (set-window-parameter nil 'mode-line-format 'none)
        (org-capture)))
#+END_SRC
* Projectile
** Project Search Path
#+begin_src elisp
;; (setq projectile-project-search-path '(("~/Code/" . 2)))
#+end_src
* Development
** Language-Specific Settings
*** Web Dev (JS/TS/CSS)
**** Testing
***** Jest Test Mode
Jest-Test-Mode.el is a minor mode for running jest via npx.

#+begin_src elisp :tangle packages.el
(package! jest-test-mode)
#+end_src

#+begin_src elisp
(use-package! jest-test-mode
  :commands jest-test-mode
  :hook (typescript-mode js-mode typescript-tsx-mode))
#+end_src
**** Svelte
#+begin_src elisp :tangle packages.el
(package! svelte-mode)
#+end_src

#+begin_src elisp
(use-package! svelte-mode
  :mode "\\.svelte\\'")
#+end_src

**** Vue
***** LSP
The package lsp-mode has an issue with volar in version 8.0.0, so until the
issues are in the next release of lsp-mode (and doom), I'm unpinning the
package.

#+begin_src elisp :tangle packages.el
(unpin! lsp-mode)
#+end_src

To get lsp support working, there needs to be a ~.volarrc~ file in the project's
root directory.

***** Formatting

Remove 1 space padding from <script> tags

#+begin_src elisp
(with-eval-after-load 'web-mode
  (setq web-mode-script-padding 0))
#+end_src
**** Tailwind
Add the tailwind lsp package
#+begin_src elisp :tangle packages.el
(package! lsp-tailwindcss
  :recipe (:host github
           :repo "merrickluo/lsp-tailwindcss"))
#+end_src

...and use it
#+begin_src elisp
(use-package! lsp-tailwindcss
  :defer t
  :init
  (setq lsp-tailwindcss-add-on-mode t))
#+end_src

**** Code formatting
Set typescript file indentation to be 2 levels by default.
#+begin_src elisp
(setq typescript-indent-level 2)
#+end_src

*** Nix
**** nix-mode.el
[[https://github.com/NixOS/nix-mode][Nix-mode]] is a major mode for editing nix expressions. It comes with a variaty of submodules
#+begin_src elisp
(use-package! nix-mode
  :mode "\\.nix\\'")
#+end_src

***** nix.el
Nix.el contains some miscellanious tools. Interactive functions include:

- nix-unpack - unpack source of a Nix attribute.
  Available via ~M-x nix-unpack~ followed by the nix path and attribute path.

- nix-build - functions similar to ~M-x compile~. Will build in the current
  directory if it contains a ~default.nix~.

There are also basic functions for interacting with nix - some variables are
provided to point to Nix binaries that can be used in Lisp code.

- ~nix-executable~
- ~nix-build-executable~
- ~nixinstantiate-executable~
- ~nix-store-executable~
- ~nix-shell-executable~

Also, a function ~nix-system~ is provided to get the current system (the way Nix
detects it).

***** nix-flake.el

Uses transient.el to provide a magit-like interface for supporting flake
commands.
Using ~M-x nix-flake~ commands can be run on the current flake, whereas ~M-x
~nix-flake-init~ can initialize a flake from a atemplate.

***** nix-repls.el

Provides an interface for completion, nused by nix-company.el. Secondly it
provides an interactive function to open a repl via ~M-x nix-repl~

***** nix-store.el

Displays information about the store path including logs associated with a
derivation.

***** nix-prettify-mode.el

Improves display of store paths.

**** nix-buffer
Adds an emacs command to modify the buffer environment according to a Lisp
expression buily by nix.

*** Python
**** Poetry
After years of frustration, I'm finally content with setting up and managing
projects in the Python ecosystem, thanks to Poetry. It's a great tool, and
luckily, there is excellent integration with Emacs.

#+begin_src elisp :tangle packages.el
(package! poetry)
#+end_src

**** Run pytest in virtualenv
python-pytest does not use the virtualenv's binary by default. As a fix, I'm
adding a hook to python-mode to set the correct executable - since python-mode
plays nicely with direnv.

#+begin_src elisp
(add-hook! python-mode
  (advice-add 'python-pytest-file :before
              (lambda (&rest args)
                (setq-local python-pytest-executable
                            (executable-find "pytest")))))
#+end_src

*** Markdown
**** TODO Code blocks
To set up code-highlighting in markdown code blocks, I need multiple major modes in one buffer. The package polymode promises to allow that:
#+begin_src elisp
;; (use-package! polymode
;; (use-package! poly-markdown)
#+end_src

**** Live Preview
Impatient-Mode is a package to live-preview HTMl, and with a trick, it can be
used to preview markdown.

First, install the dependency.
#+begin_src elisp :tangle packages.el
(package! impatient-mode)
#+end_src

To use it:

- Start an emacs' web server with M-x httpd-start.
- Start impatient mode in the buffers you're interested to live preview: M-x impatient-mode.
- Open your browser to localhost:8080/imp. You'll see the list of buffers with the mode enabled. Click on one: you see live rendering of the buffer.

Then, set up a markdown-html function.

#+begin_src emacs-lisp
(defun markdown-html (buffer)
  (princ (with-current-buffer buffer
           (format "<!DOCTYPE html><html><title>Impatient Markdown</title><xmp theme=\"united\" style=\"display:none;\"> %s  </xmp><script src=\"http://ndossougbe.github.io/strapdown/dist/strapdown.js\"></script></html>" (buffer-substring-no-properties (point-min) (point-max))))
         (current-buffer)))
#+end_src

*** Terraform
There are two competing lsp servers for Terraform with support in Emacs, but,
although ~terraform-lsp~ is the more featurerich, I'm sticking with ~terraform-ls~
since it's not only more reliable, but seems to not work with TF versions above 0.12.
But still, ~terraform-lsp~ is a good alternative, with some nice- to- haves.

#+begin_src elisp
(setq lsp-terraform-ls-enable-show-reference t)
(setq lsp-semantic-tokens-enable t)
(setq lsp-semantic-tokens-honor-refresh-requests t)
#+end_src
** Tools
*** Code Completion
Since it's already integrated into Doom Emacs, I'm using company for code
completion.

**** Handling
I don't want any delay in showing suggestions, unless I'm writing a string or a
comment, then I want company to not show any suggestions at all.

#+begin_src elisp
(setq company-idle-delay 0.35 ;; How long to wait before popping up
      company-minimum-prefix-length 2 ;; Show the menu after one key press
      company-tooltip-limit 10 ;; Limit on how many options to display
      company-tooltip-align-annotations t ;; Align annotations to the right
      company-require-match nil           ;; Allow free typing
      company-selection-wrap-around t ;; Wrap around to beginning when you hit bottom of suggestions
      )
#+end_src

**** Backends
A backend is responsible for providing the completion suggestions. As I'm using
LSP where possible, and I don't want to use snippets in that way, I'm going to
keep the list of backends very short.

#+begin_src elisp
(after! lsp-mode
  (setq company-backends '(company-capf)))
#+end_src

**** Looks
For the icons, I'm using VSCode icons. The nomenclature is a little confusing,
to determine, what to put in the margin, company has to execute a function. So
using the function ~company-vscode-dark-icons-margin~ here means just setting
those icons as what's being displayed.

#+begin_src elisp
(setq company-format-margin-function #'company-vscode-dark-icons-margin)
#+end_src

*** Copilot
**** Getting a Node 16 binary
Currently, this plugin only works with an older version of node (16) installed,
which is handled via nvm. Since I'm using this concept on multiple machines, it
makes sense to get the nvm version's path programatically.

Since I'm installing all my emacs modules via nix, the ~:recipe~ declaration is
useless and ist just left in so that this config will still work on its own.

The actual package is defined in my nix config.
#+begin_src elisp :tangle packages.el
(package! copilot :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src elisp :tangle packages.el
(package! nvm)
#+end_src


First, I'm defining a helper function to call nvm after sourcing my zsh config
(which provides nvm).
#+begin_src elisp
(defun call-nvm (args &optional as-string)
  (let ((nvm-command "source $XDG_CONFIG_HOME/zsh/.zshrc && nvm"))
    (if as-string
        (shell-command-to-string (concat nvm-command " " args))
      (shell-command (concat nvm-command " " args)))))
#+end_src

Then, I'm using the ~call-nvm~ function to create a function that will install
node 16 via ~nvm~ if it's not already installed.
#+begin_src elisp
(defun install-node-if-missing ()
  (if (not (eq 0 (call-nvm "ls 16")))
      (call-nvm "install 16")))
#+end_src


