home/config/doom/packages.el

(package! devdocs)

;; (package! dash-docs)

(package! gpt)

(package! gptel)

(package! doom-themes)

(package! grayscale-theme)

(package! tao-theme)

(package! ewal)
(package! ewal-doom-themes)

(package! theme-magic)

(package! autothemer)

;; (package! which-key-posframe)
