home/config/doom/config.org
**** All-The-Icons Ivy Rich

Per default, Ivy looks a little bland. All-The-Icons-Ivy Richt is an alternative
to All-The-icons-Ivy (which had some issues with my setup)

#+begin_src elisp :tangle packages.el
;; (package! all-the-icons-ivy-rich)
#+end_src

#+begin_src elisp
;; (use-package! all-the-icons-ivy-rich
;;   :defer t
;;   :after counsel-projectile
;;   :init (all-the-icons-ivy-rich-mode +1)
;;   :config
;;   (setq all-the-icons-ivy-rich-icon-size 0.8))
#+end_src

**** Ivy-Postframe

Doom Emacs already has Ivy-Postframe enabled, so there are just some tweaks to
be made.

Per default, the window has a dynamic width, which means that when typing, it
will rapidly change its width, which is not very pleasant to look at.
#+begin_src elisp
(setq ivy-posframe-width 80)
#+end_src

** Treemacs

Treemacs is a file and project explorer similar to NeoTree or vim’s
NerdTree, but largely inspired by the Project Explorer in Eclipse.
It shows the file system outlines of your projects in a simple tree layout
allowing quick navigation
and exploration, while also possessing basic file management utilities.

*** Treemacs-All-The-Icons

Treemacs also has a package that adds icons to the file explorer.

#+begin_src elisp :tangle packages.el
(package! treemacs-all-the-icons)
#+end_src

** Vertico
Prefix the current candidte with an arrow
#+begin_src elisp
(defun minibuffer-format-candidate (orig cand prefix suffix index _start)
  (let ((prefix (if (= vertico--index index)
                    "  " "   ")))
    (funcall orig cand prefix suffix index _start)))

(advice-add #'vertico--format-candidate
            :around #'minibuffer-format-candidate)
#+end_src

Don't show results count
#+begin_src elisp
(setq vertico-count-format nil)
#+end_src

Make vertico-posframe a little wider
#+begin_src elisp
(setq vertico-posframe-width 200)
#+end_src

** Xwidget Webkit
*** Emacs xwidget-webkit enhancement suite

Xwwp (https://github.com/BlueFlo0d/xwwp) is a package that enhances the
xwidget-webkit browser.

#+begin_src elisp :tangle packages.el
(package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp"))
(package! xwwp-follow-link-ivy)
(package! ctable)
#+end_src

#+begin_src elisp
(use-package! xwwp-full
  :after xwidget-webkit
  :custom
  (xwwp-follow-link-completion-system 'ivy)
  :bind (:map xwidget-webkit-mode-map
              ("f" . xwwp-ace-toggle)
              ("v" . xwwp-follow-link)))
#+end_src
* Performance
Various tweaks to improve the overall performance.

Raise the GC-Cons threshold:
#+begin_src elisp
(setq gc-cons-threshold (* 1024 1024 1024)) ;; 1G
#+end_src

Increase the amount of data which Emacs reads from the process:
#+begin_src elisp
(setq read-process-output-max (* 4 1024 1024)) ;; 4mb
#+end_src
