home/config/doom/packages.el

;; (package! all-the-icons-ivy-rich)

(package! treemacs-all-the-icons)

(package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp"))
(package! xwwp-follow-link-ivy)
(package! ctable)
